In [1]:
%reload_ext sql

%sql postgresql://postgres:Adetorera11@localhost/countries

FIRST PROJECT

 **USING JOINS**
 
*Display countries and their population size.

*display countries and their currencies

*display countries and their fertility rate

*display countries, continent, income group, and thier total investment

*display cities, country, region, independence year

*display Asian countries, and their langauges

*display European countries, life expectancy, inflation rate

*QUESTION 1
*Display countries and their population size.*

In [2]:
%%sql
SELECT 
        name AS countries,
         size AS population_size
FROM countries
INNER JOIN populations 
          ON code = country_code
LIMIT 10

 * postgresql://postgres:***@localhost/countries
10 rows affected.

[('Aruba', 101597.0),
 ('Aruba', 103889.0),
 ('Afghanistan', 27962208.0),
 ('Afghanistan', 32526562.0),
 ('Angola', 21219954.0),
 ('Angola', 25021974.0),
 ('Albania', 2913021.0),
 ('Albania', 2889167.0),
 ('Andorra', 84419.0),
 ('Andorra', 70473.0)]

*QUESTION 2 *display countries and their currencies

In [9]:
%%sql
SELECT 
       name  AS countries,
       basic_unit AS currencies
FROM 
       countries AS co
LEFT JOIN currencies AS cu
          USING(code)
LIMIT 10

 * postgresql://postgres:***@localhost/countries
10 rows affected.

[('Afghanistan', 'Afghan afghani'),
 ('Netherlands', 'Euro'),
 ('Albania', 'Albanian lek'),
 ('Algeria', 'Algerian dinar'),
 ('American Samoa', None),
 ('Andorra', 'Euro'),
 ('Angola', 'Angolan kwanza'),
 ('Antigua and Barbuda', 'East Caribbean dollar'),
 ('United Arab Emirates', 'United Arab Emirates dirham'),
 ('Argentina', 'Argentine peso')]

*QUESTION 3
*display countries and their fertility rate

In [7]:
%%sql
SELECT 
       name  AS countries,
       fertility_rate
FROM 
        populations
LEFT JOIN countries 
        ON code = country_code

LIMIT 10

 * postgresql://postgres:***@localhost/countries
10 rows affected.

[('Aruba', 1.704),
 ('Aruba', 1.647),
 ('Afghanistan', 5.746),
 ('Afghanistan', 4.653),
 ('Angola', 6.416),
 ('Angola', 5.996),
 ('Albania', 1.663),
 ('Albania', 1.793),
 ('Andorra', 1.27),
 ('Andorra', None)]

*QUESTION 4 *display countries, continent, income group, and thier total investment

In [14]:
%%sql
SELECT 
         name  AS countries,
         continent,
         income_group,
         total_investment
FROM
        countries AS co
LEFT JOIN economies AS ec
       ON co.code = ec.code
LIMIT 10

 * postgresql://postgres:***@localhost/countries
10 rows affected.

[('Afghanistan', 'Asia', 'Low income', 30.402),
 ('Afghanistan', 'Asia', 'Low income', 18.602),
 ('Angola', 'Africa', 'Upper middle income', 14.433),
 ('Angola', 'Africa', 'Upper middle income', 9.552),
 ('Albania', 'Europe', 'Upper middle income', 31.305),
 ('Albania', 'Europe', 'Upper middle income', 24.598),
 ('United Arab Emirates', 'Asia', 'High income', 27.372),
 ('United Arab Emirates', 'Asia', 'High income', 27.477),
 ('Argentina', 'South America', 'Upper middle income', 17.706),
 ('Argentina', 'South America', 'Upper middle income', 16.89)]

*QUESTION 5 *display cities, country, region, independence year

In [11]:
%%sql
SELECT 
        cities.name AS cities,
        countries.name AS countries,
        region,
        indep_year
FROM countries
INNER JOIN cities
        ON code = country_code
limit 10

 * postgresql://postgres:***@localhost/countries
10 rows affected.

[('Abidjan', "Cote d'Ivoire", 'Western Africa', 1960),
 ('Abu Dhabi', 'United Arab Emirates', 'Middle East', 1971),
 ('Abuja', 'Nigeria', 'Western Africa', 1960),
 ('Accra', 'Ghana', 'Western Africa', 1957),
 ('Addis Ababa', 'Ethiopia', 'Eastern Africa', -1000),
 ('Ahmedabad', 'India', 'Southern and Central Asia', 1947),
 ('Alexandria', 'Egypt', 'Northern Africa', 1922),
 ('Algiers', 'Algeria', 'Northern Africa', 1962),
 ('Almaty', 'Kazakhstan', 'Southern and Central Asia', 1991),
 ('Ankara', 'Turkey', 'Middle East', 1923)]

*QUESTION 6 *display Asian countries, and their langauges

In [12]:
%%sql
SELECT  
        continent AS countries,
         la.name AS languages
FROM  
       countries AS co
LEFT JOIN languages AS la
        ON co.code = la.code
WHERE continent = 'Asia' 
LIMIT 10

 * postgresql://postgres:***@localhost/countries
10 rows affected.

[('Asia', 'Dari'),
 ('Asia', 'Pashto'),
 ('Asia', 'Turkic'),
 ('Asia', 'Other'),
 ('Asia', 'Armenian'),
 ('Asia', 'Kurdish'),
 ('Asia', 'Other'),
 ('Asia', 'Azerbaijani'),
 ('Asia', 'Russian'),
 ('Asia', 'Armenian')]

*QUESTION 7 *display European countries, life expectancy, inflation rate

In [15]:
%%sql
SELECT 
       name AS european_countries,
       life_expectancy,
        inflation_rate
FROM eu_countries AS eu
LEFT JOIN  economies AS ec
     USING (code)
LEFT JOIN populations AS po
       ON code = country_code
LIMIT 10

 * postgresql://postgres:***@localhost/countries
10 rows affected.

[('Austria', 81.8439, 1.694),
 ('Austria', 80.58049, 1.694),
 ('Austria', 81.8439, 0.81),
 ('Austria', 80.58049, 0.81),
 ('Belgium', 81.2878, 2.334),
 ('Belgium', 80.18293, 2.334),
 ('Belgium', 81.2878, 0.62),
 ('Belgium', 80.18293, 0.62),
 ('Bulgaria', 74.46585, 3.039),
 ('Bulgaria', 73.51219, 3.039)]